export default {
  warnings: {
    straightRow:
      'ردیف‌های مستقیم کلیدها روی صفحه کلید به راحتی قابل حدس زدن هستند.',
    keyPattern: 'حدس زدن الگوهای کوتاه روی صفحه کلید آسان است.',
    simpleRepeat: 'کاراکترهای تکراری مانند "للل" به راحتی قابل حدس زدن هستند.',
    extendedRepeat:
      'الگوهای تکراری مانند "سشصضسشصض" به راحتی قابل حدس زدن هستند.',
    sequences:
      'کاراکترهای پشت سر هم رایش مانند "ظطزرذ" به راحتی قابل حدس زدن هستند.',
    recentYears: 'حدس زدن سال‌های اخیر آسان است.',
    dates: 'حدس زدن تاریخ‌ها آسان است.',
    topTen: 'این رمز عبور بسیار پر استفاده است.',
    topHundred: 'این رمز عبور پر استفاده است.',
    common: 'این یک رمز عبور رایج است.',
    similarToCommon: 'این رمز عبور مشابه یک رمز عبور رایج است.',
    wordByItself: 'حدس زدن کلمات تکی آسان است.',
    namesByThemselves: 'حدس زدن نام یا نام خانوادگی ساده است.',
    commonNames: 'حدس زدن نام و نام خانوادگی معمولی آسان است.',
    userInputs: 'هیچ داده شخصی یا مربوط به صفحه نباید وجود داشته باشد.',
    pwned: 'رمز عبور شما در اینترنت فاش شده است.',
  },
  suggestions: {
    l33t: "از کاراکترهای جایگزین مانند '@' بجای 'a' استفاده نکنید.",
    reverseWords: 'از املای معکوس کلمات رایج استفاده نکنید.',
    allUppercase: 'برخی از حروف را بزرگ کنید، اما نه همه.',
    capitalization: 'جز حرف اول بعضی از حرف‌های دیگر را نیز بزرگ کنید.',
    dates: 'از تاریخ‌ها و سال‌هایی که با شما مرتبط هستند استفاده نکنید.',
    recentYears: 'از بکار بردن سال‌های اخیر استفاده نکنید.',
    associatedYears:
      'از تاریخ‌ها و سال‌هایی که با شما مرتبط هستند استفاده نکنید.',
    sequences: 'از توالی کاراکترهای رایج استفاده نکنید.',
    repeated: 'از کلمات و کاراکترهای تکراری پشت سر هم استفاده نکنید.',
    longerKeyboardPattern:
      'از الگوهای صفحه کلید طولانی‌تر استفاده کنید و جهت تایپ را چندین بار تغییر دهید.',
    anotherWord: 'کلمات بیشتری را اضافه کنید که رایج نباشند.',
    useWords: 'از چند کلمه استفاده کنید، اما از عبارات رایج استفاده نکنید.',
    noNeed:
      'شما می توانید بدون استفاده از نمادها، اعداد یا حروف بزرگ رمزهای عبور قوی ایجاد کنید.',
    pwned:
      'اگر از این رمز عبور در جای دیگری استفاده می کنید، باید آن را تغییر دهید.',
  },
  timeEstimation: {
    ltSecond: 'کمتر از یک ثانیه',
    second: '{base} ثانیه',
    seconds: '{base} ثانیه',
    minute: '{base} دقیقه',
    minutes: '{base} دقیقه',
    hour: '{base} ساعت',
    hours: '{base} ساعت',
    day: '{base} روز',
    days: '{base} روز',
    month: '{base} ماه',
    months: '{base} ماه',
    year: '{base} سال',
    years: '{base} سال',
    centuries: 'قرن‌ها',
  },
}
